
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>01. 介绍 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="02.GettingStarted.html" />
    
    
    <link rel="prev" href="00.Terminology.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    首页
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="00.Terminology.html">
            
                <a href="00.Terminology.html">
            
                    
                    00. 术语表
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.3" data-path="01.Introduction.html">
            
                <a href="01.Introduction.html">
            
                    
                    01. 介绍
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="02.GettingStarted.html">
            
                <a href="02.GettingStarted.html">
            
                    
                    02. 开始
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="03.GoingFurther.html">
            
                <a href="03.GoingFurther.html">
            
                    
                    03. 更进一步
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="04.ProceduresAndVariableBindings.html">
            
                <a href="04.ProceduresAndVariableBindings.html">
            
                    
                    04. 过程和变量绑定
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="05.ControlOperations.html">
            
                <a href="05.ControlOperations.html">
            
                    
                    05. 控制操作
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="06.OperationsOnObjects.html">
            
                <a href="06.OperationsOnObjects.html">
            
                    
                    06. 对象操作
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="07.InputAndOutput.html">
            
                <a href="07.InputAndOutput.html">
            
                    
                    07. 输入输出
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="08.SyntacticExtension.html">
            
                <a href="08.SyntacticExtension.html">
            
                    
                    08. 语法扩展
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="09.Records.html">
            
                <a href="09.Records.html">
            
                    
                    09. 记录类型
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="10.LibrariesAndTop-LevelPrograms.html">
            
                <a href="10.LibrariesAndTop-LevelPrograms.html">
            
                    
                    10. 库和顶层程序
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="11.ExceptionsAndConditions.html">
            
                <a href="11.ExceptionsAndConditions.html">
            
                    
                    11. 异常和状态
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="12.ExtendedExamples.html">
            
                <a href="12.ExtendedExamples.html">
            
                    
                    12. 例子
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >01. 介绍</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x7B2C;&#x4E00;&#x7AE0;-&#x7B80;&#x4ECB;">&#x7B2C;&#x4E00;&#x7AE0; &#x7B80;&#x4ECB;</h1>
<p>Scheme&#x662F;&#x4E00;&#x79CD;&#x901A;&#x7528;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x3002;&#x5B83;&#x662F;&#x4E00;&#x79CD;&#x9AD8;&#x7EA7;&#x8BED;&#x8A00;&#xFF0C;&#x652F;&#x6301;&#x5B57;&#x7B26;&#x4E32;&#x3001;&#x5217;&#x8868;&#x3001;&#x5411;&#x91CF;&#x8FD9;&#x6837;&#x7684;&#x7ED3;&#x6784;&#x5316;&#x6570;&#x636E;&#xFF0C;&#x4EE5;&#x53CA;&#x6570;&#x5B57;&#x3001;&#x5B57;&#x7B26;&#x8FD9;&#x6837;&#x7684;&#x4F20;&#x7EDF;&#x6570;&#x636E;&#x3002;&#x867D;&#x7136;Scheme&#x901A;&#x5E38;&#x88AB;&#x7528;&#x4E8E;&#x7B26;&#x53F7;&#x8FD0;&#x7B97;&#xFF0C;&#x4F46;&#x5F97;&#x76CA;&#x4E8E;&#x4E30;&#x5BCC;&#x7684;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x96C6;&#x548C;&#x7075;&#x6D3B;&#x7684;&#x63A7;&#x5236;&#x7ED3;&#x6784;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x8BF4;&#x662F;&#x4E00;&#x79CD;&#x771F;&#x6B63;&#x7684;&#x901A;&#x7528;&#x8BED;&#x8A00;&#x3002;Scheme&#x5DF2;&#x88AB;&#x7528;&#x6765;&#x7F16;&#x5199;&#x6587;&#x672C;&#x7F16;&#x8F91;&#x5668;&#xFF0C;&#x4F18;&#x5316;&#x7F16;&#x8BD1;&#x5668;&#xFF0C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#xFF0C;&#x56FE;&#x5F62;&#x5904;&#x7406;&#xFF0C;&#x4E13;&#x5BB6;&#x7CFB;&#x7EDF;&#xFF0C;&#x6570;&#x503C;&#x8FD0;&#x7B97;&#xFF0C;&#x91D1;&#x878D;&#x5206;&#x6790;&#xFF0C;&#x865A;&#x62DF;&#x73B0;&#x5B9E;&#x7CFB;&#x7EDF;&#x548C;&#x51E0;&#x4E4E;&#x6240;&#x6709;&#x53EF;&#x4EE5;&#x60F3;&#x5230;&#x7684;&#x7A0B;&#x5E8F;&#x7C7B;&#x578B;&#x3002;scheme&#x975E;&#x5E38;&#x7B80;&#x5355;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x53EA;&#x57FA;&#x4E8E;&#x5C11;&#x6570;&#x8BED;&#x6CD5;&#x5F62;&#x5F0F;&#x548C;&#x8BED;&#x4E49;&#x6982;&#x5FF5;&#xFF0C;&#x800C;&#x4E14;&#x5927;&#x591A;&#x6570;&#x5B9E;&#x73B0;&#x90FD;&#x80FD;&#x4EA4;&#x4E92;&#xFF0C;&#x9F13;&#x52B1;&#x7528;&#x6237;&#x53BB;&#x5C1D;&#x8BD5;&#x3002;&#x4F46;scheme&#x4E5F;&#x5F88;&#x96BE;&#xFF0C;&#x60F3;&#x53D1;&#x6325;&#x5176;&#x5168;&#x90E8;&#x6F5C;&#x80FD;&#xFF0C;&#x79BB;&#x4E0D;&#x5F00;&#x94BB;&#x7814;&#x548C;&#x5B9E;&#x8DF5;&#x3002;</p>
<p>&#x5728;&#x540C;&#x4E00;&#x5B9E;&#x73B0;&#x4E0B;&#xFF0C;scheme&#x7A0B;&#x5E8F;&#x53EF;&#x79FB;&#x690D;&#x6027;&#x5F88;&#x5F3A;&#xFF0C;&#x56E0;&#x4E3A;&#x5E95;&#x5C42;&#x51E0;&#x4E4E;&#x5B8C;&#x5168;&#x88AB;&#x9690;&#x85CF;&#x4E86;&#x3002;scheme&#x4E5F;&#x53EF;&#x4EE5;&#x5728;&#x4E0D;&#x540C;&#x5B9E;&#x73B0;&#x95F4;&#x79FB;&#x690D;&#xFF0C;&#x8FD9;&#x5F52;&#x529F;&#x4E8E;&#x4E00;&#x7FA4;&#x8BED;&#x8A00;&#x8BBE;&#x8BA1;&#x8005;&#x7684;&#x5171;&#x540C;&#x52AA;&#x529B;&#xFF0C;&#x4ED6;&#x4EEC;&#x53D1;&#x8868;&#x4E86;&#x4E00;&#x7CFB;&#x5217;&#x62A5;&#x544A;&#xFF0C;&#x79F0;&#x4E3A;Revised Reports on Scheme&#xFF0C;&#x7B80;&#x79F0;RnRS&#x3002;&#x6700;&#x65B0;&#x7684;&#x7B2C;6&#x7248;&#x62A5;&#x544A;&#xFF0C;&#x5373;R6RS&#xFF0C;&#x5F3A;&#x8C03;&#x8981;&#x501F;&#x52A9;&#x6807;&#x51C6;&#x5E93;&#x548C;&#x6807;&#x51C6;&#x673A;&#x5236;&#xFF0C;&#x5B9A;&#x4E49;&#x65B0;&#x7684;&#x53EF;&#x79FB;&#x690D;&#x5E93;&#x548C;&#x9876;&#x5C42;&#x7A0B;&#x5E8F;&#x3002;</p>
<p>&#x5C3D;&#x7BA1;&#x4E00;&#x4E9B;&#x65E9;&#x671F;&#x5B9E;&#x73B0;&#x6548;&#x7387;&#x4F4E;&#x4E0B;&#xFF0C;&#x4F46;&#x662F;&#x8BB8;&#x591A;&#x57FA;&#x4E8E;&#x7F16;&#x8BD1;&#x5668;&#x7684;&#x65B0;&#x5B9E;&#x73B0;&#x90FD;&#x5F88;&#x5FEB;&#xFF0C;&#x53EF;&#x4EE5;&#x4E0E;&#x4F4E;&#x7EA7;&#x8BED;&#x8A00;&#x76F8;&#x5AB2;&#x7F8E;&#x3002;&#x6709;&#x65F6;&#x4ECD;&#x7136;&#x5B58;&#x5728;&#x7684;&#x76F8;&#x5BF9;&#x7684;&#x4F4E;&#x6548;&#x7387;&#xFF0C;&#x90A3;&#x662F;&#x56E0;&#x4E3A;&#x8FD0;&#x884C;&#x65F6;&#x7684;&#x68C0;&#x67E5;&#xFF0C;&#x5B83;&#x4EEC;&#x652F;&#x6301;&#x901A;&#x7528;&#x8FD0;&#x7B97;&#xFF0C;&#x80FD;&#x5E2E;&#x7A0B;&#x5E8F;&#x5458;&#x68C0;&#x6D4B;&#x3001;&#x7EA0;&#x6B63;&#x5404;&#x79CD;&#x5E38;&#x89C1;&#x7684;&#x9519;&#x8BEF;&#x3002;&#x5728;&#x8BB8;&#x591A;&#x5B9E;&#x73B0;&#x4E2D;&#xFF0C;&#x90FD;&#x53EF;&#x4EE5;&#x7981;&#x7528;&#x68C0;&#x67E5;&#x3002;</p>
<p>Scheme&#x652F;&#x6301;&#x591A;&#x79CD;&#x7C7B;&#x578B;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x6216;&#x8005;&#x8BF4;<em>&#x5BF9;&#x8C61;</em> &#xFF0C;&#x6BD4;&#x5982;&#x5B57;&#x7B26;&#xFF0C;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x7B26;&#x53F7;&#xFF0C;&#x5217;&#x8868;&#x548C;&#x5411;&#x91CF;&#xFF0C;&#x4EE5;&#x53CA;&#x6240;&#x6709;&#x6570;&#x5B57;&#x7C7B;&#x578B;&#xFF0C;&#x5305;&#x62EC;&#x590D;&#x6570;&#x3001;&#x5B9E;&#x6570;&#x548C;&#x4EFB;&#x610F;&#x7CBE;&#x5EA6;&#x6709;&#x7406;&#x6570;&#x3002;</p>
<p>&#x7A0B;&#x5E8F;&#x4F1A;&#x6839;&#x636E;&#x9700;&#x8981;&#xFF0C;&#x52A8;&#x6001;&#x5206;&#x914D;&#x50A8;&#x5B58;&#x7A7A;&#x95F4;&#x6765;&#x5B58;&#x653E;&#x5BF9;&#x8C61;&#xFF0C;&#x5E76;&#x4FDD;&#x7559;&#x7A7A;&#x95F4;&#xFF0C;&#x76F4;&#x5230;&#x4E0D;&#x518D;&#x9700;&#x8981;&#x4E3A;&#x6B62;&#xFF0C;&#x7136;&#x540E;&#x4F7F;&#x7528;<em>&#x5783;&#x573E;&#x56DE;&#x6536;&#x5668;</em>&#xFF0C;&#x5B9A;&#x671F;&#x56DE;&#x6536;&#x65E0;&#x6548;&#x5BF9;&#x8C61;&#x7684;&#x7A7A;&#x95F4;&#x3002;&#x7B80;&#x5355;&#x7684;&#x539F;&#x59CB;&#x503C;&#xFF0C;&#x4F8B;&#x5982;&#x5C0F;&#x6574;&#x6570;&#xFF0C;&#x5B57;&#x7B26;&#xFF0C;&#x5E03;&#x5C14;&#x503C;&#x548C;&#x7A7A;&#x8868;&#xFF0C;&#x901A;&#x5E38;&#x8868;&#x793A;&#x4E3A;&#x7ACB;&#x5373;&#x6570;&#xFF0C;&#x56E0;&#x6B64;&#x4E0D;&#x4F1A;&#x4EA7;&#x751F;&#x5206;&#x914D;&#x6216;&#x56DE;&#x6536;&#x7684;&#x5F00;&#x9500;&#x3002;</p>
<p>&#x4E0D;&#x8BBA;&#x600E;&#x4E48;&#x8868;&#x793A;&#xFF0C;&#x6240;&#x6709;&#x5BF9;&#x8C61;&#x90FD;&#x662F;<em>&#x7B2C;&#x4E00;&#x7C7B;&#x5BF9;&#x8C61;</em>&#xFF0C;&#x53C8;&#x79F0;&#x4E3A;&#x5934;&#x7B49;&#x516C;&#x6C11;&#x3002;&#x56E0;&#x4E3A;&#x4ED6;&#x4EEC;&#x53EF;&#x4EE5;&#x6C38;&#x4E45;&#x4FDD;&#x7559;&#xFF0C;&#x6240;&#x4EE5;&#x53EF;&#x4EE5;&#x4F5C;&#x4E3A;&#x53C2;&#x6570;&#x81EA;&#x7531;&#x4F20;&#x9012;&#xFF0C;&#x4F5C;&#x4E3A;&#x8FD4;&#x56DE;&#x503C;&#x5F62;&#x6210;&#x65B0;&#x5BF9;&#x8C61;&#x3002;&#x8FD9;&#x4E0E;&#x8BB8;&#x591A;&#x8BED;&#x8A00;&#x5F62;&#x6210;&#x9C9C;&#x660E;&#x5BF9;&#x6BD4;&#xFF0C;&#x5B83;&#x4EEC;&#x7684;&#x590D;&#x5408;&#x6570;&#x636E;&#x2014;&#x2014;&#x6BD4;&#x5982;&#x6570;&#x7EC4;&#x2014;&#x2014;&#x662F;&#x9759;&#x6001;&#x5206;&#x914D;&#x7684;&#xFF0C;&#x800C;&#x4E14;&#x4ECE;&#x4E0D;&#x91CA;&#x653E;&#xFF0C;&#x5728;&#x4EE3;&#x7801;&#x5757;&#x7684;&#x5165;&#x53E3;&#x5206;&#x914D;&#xFF0C;&#x5728;&#x51FA;&#x53E3;&#x65E0;&#x6761;&#x4EF6;&#x91CA;&#x653E;&#xFF0C;&#x6216;&#x8005;&#x7531;&#x7A0B;&#x5E8F;&#x5458;&#x624B;&#x52A8;&#x5206;&#x914D;&#x6216;&#x91CA;&#x653E;&#x3002;</p>
<p>Scheme&#x662F;&#x4E00;&#x79CD;&#x4F20;&#x503C;&#x8C03;&#x7528;&#x7684;&#x8BED;&#x8A00;&#xFF0C;&#x4F46;&#x662F;&#x81F3;&#x5C11;&#x5BF9;&#x4E8E;&#x53EF;&#x53D8;&#x5BF9;&#x8C61;&#xFF0C;&#x503C;&#x50A8;&#x5B58;&#x7684;&#x662F;&#x5730;&#x5740;&#x3002;&#x4F46;&#x8FD9;&#x4E9B;&#x5730;&#x5740;&#x88AB;&#x9690;&#x85CF;&#x8D77;&#x6765;&#x4E86;&#xFF0C;&#x7A0B;&#x5E8F;&#x5458;&#x4E0D;&#x9700;&#x8981;&#x77E5;&#x9053;&#x8FD9;&#x4E9B;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x77E5;&#x9053;&#x7684;&#x662F;&#xFF0C;&#x5F53;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x88AB;&#x4F20;&#x9012;&#x6216;&#x8005;&#x8FD4;&#x56DE;&#x65F6;&#xFF0C;&#x5E76;&#x6CA1;&#x6709;&#x590D;&#x5236;&#x5BF9;&#x8C61;&#xFF0C;&#x53EA;&#x662F;&#x4F20;&#x9012;&#x4E86;&#x5730;&#x5740;&#x3002;</p>
<p>Scheme&#x7684;&#x6838;&#x5FC3;&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x5C0F;&#x7684;&#x8BED;&#x6CD5;&#x5185;&#x6838;&#xFF0C;&#x662F;&#x6240;&#x6709;&#x5176;&#x4ED6;&#x8BED;&#x6CD5;&#x5F62;&#x5F0F;&#x7684;&#x57FA;&#x7840;&#x3002;&#x8FD9;&#x4E9B;&#x6838;&#x5FC3;&#x5F62;&#x5F0F;&#x3001;&#x6D3E;&#x751F;&#x7684;&#x6269;&#x5C55;&#x8BED;&#x6CD5;&#x5F62;&#x5F0F;&#x4EE5;&#x53CA;&#x4E00;&#x7EC4;&#x539F;&#x59CB;&#x8FC7;&#x7A0B;&#x5171;&#x540C;&#x6784;&#x6210;&#x4E86;&#x5B8C;&#x6574;&#x7684;Scheme&#x8BED;&#x8A00;&#x3002;Scheme&#x7684;&#x7F16;&#x8BD1;&#x5668;&#x6216;&#x8005;&#x89E3;&#x91CA;&#x5668;&#x53EF;&#x4EE5;&#x5F88;&#x5C0F;&#xFF0C;&#x5E76;&#x4E14;&#x6709;&#x6F5C;&#x529B;&#x505A;&#x5230;&#x9AD8;&#x6548;&#x800C;&#x53EF;&#x9760;&#x3002;&#x8BB8;&#x591A;&#x62D3;&#x5C55;&#x7684;&#x8BED;&#x6CD5;&#x5F62;&#x5F0F;&#x548C;&#x539F;&#x59CB;&#x8FC7;&#x7A0B;&#xFF0C;&#x90FD;&#x53EF;&#x4EE5;&#x5728;Scheme&#x672C;&#x8EAB;&#x4E2D;&#x5B9A;&#x4E49;&#xFF0C;&#x8FD9;&#x7B80;&#x5316;&#x4E86;&#x5B9E;&#x73B0;&#xFF0C;&#x63D0;&#x9AD8;&#x4E86;&#x53EF;&#x9760;&#x6027;&#x3002;</p>
<p>Scheme&#x7A0B;&#x5E8F;&#x548C;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x5171;&#x4EAB;&#x901A;&#x7528;&#x7684;&#x8868;&#x793A;&#x5F62;&#x5F0F;&#x3002;&#x7ED3;&#x679C;&#x662F;&#xFF0C;&#x4EFB;&#x4F55;Scheme&#x7A0B;&#x5E8F;&#x90FD;&#x53EF;&#x4EE5;&#x81EA;&#x7136;&#x5730;&#x4F5C;&#x4E3A;&#x5BF9;&#x8C61;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x53D8;&#x91CF;&#x548C;&#x5173;&#x952E;&#x5B57;&#x90FD;&#x7528;&#x7B26;&#x53F7;&#x8868;&#x793A;&#xFF0C;&#x7ED3;&#x6784;&#x5316;&#x8BED;&#x6CD5;&#x5F62;&#x5F0F;&#x7528;&#x5217;&#x8868;&#x8868;&#x793A;&#x3002;&#x8FD9;&#x4E9B;&#x8868;&#x793A;&#x5F62;&#x5F0F;&#x662F;Scheme&#x8BED;&#x6CD5;&#x6269;&#x5C55;&#x529F;&#x80FD;&#x7684;&#x57FA;&#x7840;&#xFF0C;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x73B0;&#x6709;&#x8BED;&#x6CD5;&#x5F62;&#x5F0F;&#x548C;&#x8FC7;&#x7A0B;&#xFF0C;&#x5B9A;&#x4E49;&#x51FA;&#x65B0;&#x7684;&#x8BED;&#x6CD5;&#x5F62;&#x5F0F;&#x3002;&#x5B83;&#x8FD8;&#x6709;&#x52A9;&#x4E8E;&#x7528;Scheme&#x5B9E;&#x73B0;&#x81EA;&#x8EAB;&#x7684;&#x89E3;&#x91CA;&#x5668;&#x3001;&#x7F16;&#x8BD1;&#x5668;&#x548C;&#x5176;&#x4ED6;&#x7A0B;&#x5E8F;&#x8F6C;&#x6362;&#x5DE5;&#x5177;&#xFF0C;&#x5305;&#x62EC;&#x5176;&#x5B83;&#x8BED;&#x8A00;&#x7684;&#x7A0B;&#x5E8F;&#x8F6C;&#x6362;&#x5DE5;&#x5177;&#x3002;</p>
<p>Scheme&#x7684;&#x53D8;&#x91CF;&#x548C;&#x5173;&#x952E;&#x5B57;&#x4F7F;&#x7528;<em>&#x8BCD;&#x6CD5;&#x4F5C;&#x7528;&#x57DF;</em>&#xFF0C;Scheme&#x7A0B;&#x5E8F;&#x4F7F;&#x7528;&#x5757;&#x7ED3;&#x6784;&#x3002;&#x6807;&#x8BC6;&#x7B26;&#x53EF;&#x4EE5;&#x5BFC;&#x5165;&#x5230;&#x7A0B;&#x5E8F;&#x6216;&#x8005;&#x5E93;&#x4E2D;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x88AB;&#x5C40;&#x90E8;&#x7ED1;&#x5B9A;&#x5230;&#x7ED9;&#x5B9A;&#x4EE3;&#x7801;&#x5757;&#x5185;&#x90E8;&#xFF0C;&#x6BD4;&#x5982;&#x5E93;&#x3001;&#x7A0B;&#x5E8F;&#x6216;&#x8005;&#x8FC7;&#x7A0B;&#x4F53;&#x5185;&#x90E8;&#x3002;&#x5C40;&#x90E8;&#x7ED1;&#x5B9A;&#x53EA;&#x5728;&#x7279;&#x5B9A;&#x7684;&#x4EE3;&#x7801;&#x5757;&#x4E2D;&#x53EF;&#x89C1;&#x3002;&#x540C;&#x540D;&#x6807;&#x8BC6;&#x7B26;&#x5982;&#x679C;&#x51FA;&#x73B0;&#x5728;&#x4EE3;&#x7801;&#x5757;&#x5916;&#x90E8;&#xFF0C;&#x5219;&#x6307;&#x5411;&#x4E0D;&#x540C;&#x7684;&#x7ED1;&#x5B9A;&#xFF0C;&#x5982;&#x679C;&#x5728;&#x5916;&#x90E8;&#x6CA1;&#x6709;&#x7ED1;&#x5B9A;&#xFF0C;&#x90A3;&#x4E48;&#x5916;&#x90E8;&#x7684;&#x5F15;&#x7528;&#x65E0;&#x6548;&#x3002;&#x4EE3;&#x7801;&#x5757;&#x53EF;&#x4EE5;&#x5D4C;&#x5957;&#xFF0C;&#x5E76;&#x4E14;&#x5185;&#x5C42;&#x7684;&#x7ED1;&#x5B9A;&#x53EF;&#x4EE5;&#x5C4F;&#x853D;&#x5916;&#x5C42;&#x7684;&#x540C;&#x540D;&#x7ED1;&#x5B9A;&#x3002;&#x4E00;&#x4E2A;&#x7ED1;&#x5B9A;&#x7684;&#x4F5C;&#x7528;&#x57DF;&#xFF0C;&#x662F;&#x8BE5;&#x7ED1;&#x5B9A;&#x6240;&#x5728;&#x7684;&#x4EE3;&#x7801;&#x5757;&#x51CF;&#x53BB;&#x5C4F;&#x853D;&#x8BE5;&#x7ED1;&#x5B9A;&#x7684;&#x5185;&#x5C42;&#x4EE3;&#x7801;&#x5757;&#x3002;&#x6A21;&#x5757;&#x5316;&#x7A0B;&#x5E8F;&#x7528;&#x5757;&#x7ED3;&#x6784;&#x548C;&#x8BCD;&#x6CD5;&#x4F5C;&#x7528;&#x57DF;&#x6784;&#x9020;&#xFF0C;&#x5BB9;&#x6613;&#x9605;&#x8BFB;&#xFF0C;&#x7EF4;&#x62A4;&#x7B80;&#x5355;&#xFF0C;&#x800C;&#x4E14;&#x53EF;&#x9760;&#x3002;&#x7528;&#x8BCD;&#x6CD5;&#x4F5C;&#x7528;&#x57DF;&#x7684;&#x4EE3;&#x7801;&#x53EF;&#x4EE5;&#x5F88;&#x9AD8;&#x6548;&#xFF0C;&#x56E0;&#x4E3A;&#x7F16;&#x8BD1;&#x5668;&#x53EF;&#x4EE5;&#x5728;&#x6267;&#x884C;&#x7A0B;&#x5E8F;&#x4E4B;&#x524D;&#xFF0C;&#x786E;&#x5B9A;&#x6240;&#x6709;&#x7ED1;&#x5B9A;&#x7684;&#x4F5C;&#x7528;&#x57DF;&#xFF0C;&#x89E3;&#x6790;&#x51FA;&#x6BCF;&#x4E2A;&#x6807;&#x8BC6;&#x7B26;&#x5F15;&#x7528;&#x7684;&#x7ED1;&#x5B9A;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x8FD9;&#x5E76;&#x4E0D;&#x5E76;&#x4E0D;&#x662F;&#x8BF4;&#x7F16;&#x8BD1;&#x5668;&#x80FD;&#x786E;&#x5B9A;&#x6240;&#x6709;&#x53D8;&#x91CF;&#x7684;&#x503C;&#xFF0C;&#x56E0;&#x4E3A;&#x9664;&#x975E;&#x6267;&#x884C;&#x7A0B;&#x5E8F;&#x3001;&#x8BA1;&#x7B97;&#x53D8;&#x91CF;&#xFF0C;&#x5B83;&#x4EEC;&#x5728;&#x5927;&#x591A;&#x6570;&#x60C5;&#x51B5;&#x4E0B;&#x90FD;&#x662F;&#x672A;&#x77E5;&#x7684;&#x3002;</p>
<p>&#x5728;&#x5927;&#x591A;&#x6570;&#x8BED;&#x8A00;&#x4E2D;&#xFF0C;&#x8FC7;&#x7A0B;&#x7684;&#x5B9A;&#x4E49;&#x53EA;&#x662F;&#x7B80;&#x5355;&#x5730;&#x5173;&#x8054;&#x8FC7;&#x7A0B;&#x540D;&#x548C;&#x4EE3;&#x7801;&#x5757;&#xFF0C;&#x4EE3;&#x7801;&#x5757;&#x7684;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x5C31;&#x662F;&#x8FC7;&#x7A0B;&#x7684;&#x53C2;&#x6570;&#x3002;&#x5728;&#x6709;&#x4E9B;&#x8BED;&#x8A00;&#x91CC;&#xFF0C;&#x8FC7;&#x7A0B;&#x53EF;&#x4EE5;&#x5728;&#x53E6;&#x4E00;&#x4E2A;&#x8FC7;&#x7A0B;&#x6216;&#x4EE3;&#x7801;&#x5757;&#x4E2D;&#x5B9A;&#x4E49;&#xFF0C;&#x4F46;&#x53EA;&#x80FD;&#x5728;&#x5C01;&#x95ED;&#x7684;&#x4EE3;&#x7801;&#x5757;&#x88AB;&#x6267;&#x884C;&#x65F6;&#x624D;&#x80FD;&#x8C03;&#x7528;&#x3002;&#x5728;&#x53E6;&#x5916;&#x4E00;&#x4E9B;&#x8BED;&#x8A00;&#xFF0C;&#x8FC7;&#x7A0B;&#x53EA;&#x80FD;&#x5B9A;&#x4E49;&#x6210;&#x5168;&#x5C40;&#x7684;&#x3002;&#x5BF9;&#x4E8E;Scheme&#x6765;&#x8BF4;&#xFF0C;&#x8FC7;&#x7A0B;&#x53EF;&#x4EE5;&#x5B9A;&#x4E49;&#x5728;&#x53E6;&#x4E00;&#x4E2A;&#x8FC7;&#x7A0B;&#x6216;&#x8005;&#x4EE3;&#x7801;&#x5757;&#x4E2D;&#xFF0C;&#x5728;&#x5B9A;&#x4E49;&#x540E;&#x53EF;&#x4EE5;&#x968F;&#x65F6;&#x8C03;&#x7528;&#xFF0C;&#x751A;&#x81F3;&#x5728;&#x5916;&#x5C42;&#x4EE3;&#x7801;&#x7ED3;&#x675F;&#x4E4B;&#x540E;&#x4E5F;&#x6CA1;&#x95EE;&#x9898;&#x3002;&#x4E3A;&#x4E86;&#x652F;&#x6301;&#x8BCD;&#x6CD5;&#x4F5C;&#x7528;&#x57DF;&#xFF0C;Scheme&#x7684;&#x8FC7;&#x7A0B;&#x643A;&#x5E26;&#x4E86;&#x8BCD;&#x6CD5;&#x4E0A;&#x4E0B;&#x6587;&#xFF08;&#x73AF;&#x5883;&#xFF09;&#x3002;</p>
<p>&#x53E6;&#x5916;&#xFF0C;Scheme&#x7684;&#x8FC7;&#x7A0B;&#x4E0D;&#x662F;&#x90FD;&#x6709;&#x540D;&#x5B57;&#x3002;&#x5B83;&#x7684;&#x8FC7;&#x7A0B;&#x662F;&#x7B2C;&#x4E00;&#x7C7B;&#x6570;&#x636E;&#x5BF9;&#x8C61;&#xFF0C;&#x548C;&#x5B57;&#x7B26;&#x4E32;&#x3001;&#x6570;&#x5B57;&#x4E00;&#x6837;&#xFF0C;&#x53D8;&#x91CF;&#x53EF;&#x4EE5;&#x50CF;&#x7ED1;&#x5B9A;&#x5176;&#x5B83;&#x6570;&#x636E;&#x5BF9;&#x8C61;&#x4E00;&#x6837;&#x7ED1;&#x5B9A;&#x8FC7;&#x7A0B;&#x3002;</p>
<p>&#x548C;&#x5927;&#x591A;&#x6570;&#x8BED;&#x8A00;&#x4E00;&#x6837;&#xFF0C;Scheme&#x7684;&#x8FC7;&#x7A0B;&#x4E5F;&#x53EF;&#x4EE5;&#x9012;&#x5F52;&#x8C03;&#x7528;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x8FC7;&#x7A0B;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x6216;&#x95F4;&#x63A5;&#x7684;&#x8C03;&#x7528;&#x81EA;&#x5DF1;&#x3002;&#x5F88;&#x591A;&#x7B97;&#x6CD5;&#x7528;&#x9012;&#x5F52;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x5B9E;&#x73B0;&#xFF0C;&#x4F1A;&#x66F4;&#x4F18;&#x96C5;&#x3001;&#x66F4;&#x9AD8;&#x6548;&#x3002;&#x6709;&#x4E00;&#x79CD;&#x7279;&#x6B8A;&#x7684;&#x9012;&#x5F52;&#xFF0C;&#x53EB;&#x505A;&#x5C3E;&#x9012;&#x5F52;&#xFF0C;&#x5B83;&#x7528;&#x6765;&#x5B9E;&#x73B0;&#x8FED;&#x4EE3;&#x2014;&#x2014;&#x6216;&#x8005;&#x8BF4;&#x5FAA;&#x73AF;&#x2014;&#x2014;&#x7B97;&#x6CD5;&#x3002;<em>&#x5C3E;&#x9012;&#x5F52;</em>&#x53D1;&#x751F;&#x5728;&#x8FC7;&#x7A0B;&#x76F4;&#x63A5;&#x8FD4;&#x56DE;&#x8C03;&#x7528;&#x53E6;&#x4E00;&#x4E2A;&#x8FC7;&#x7A0B;&#x7684;&#x7ED3;&#x679C;&#x65F6;&#xFF0C;&#x6216;&#x8005;&#x662F;&#x8FC7;&#x7A0B;&#x76F4;&#x63A5;&#x6216;&#x95F4;&#x63A5;&#x7684;&#x5C3E;&#x8C03;&#x7528;&#x81EA;&#x5DF1;&#x65F6;&#x3002;Scheme&#x7684;&#x5B9E;&#x73B0;&#x9700;&#x8981;&#x5C06;&#x5C3E;&#x8C03;&#x7528;&#x5B9E;&#x73B0;&#x4E3A;&#x8DF3;&#x8F6C;&#xFF0C;&#x5373;goto&#xFF0C;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x907F;&#x514D;&#x548C;&#x9012;&#x5F52;&#x76F8;&#x5173;&#x7684;&#x5185;&#x5B58;&#x5F00;&#x9500;&#x3002;</p>
<p>&#x901A;&#x8FC7;<em>continuations</em>&#xFF0C;Scheme&#x53EF;&#x4EE5;&#x5B9A;&#x4E49;&#x4EFB;&#x610F;&#x7684;&#x63A7;&#x5236;&#x7ED3;&#x6784;&#x3002;continunation&#x662F;&#x4E00;&#x79CD;&#x8FC7;&#x7A0B;&#xFF0C;&#x5728;&#x7ED9;&#x7A0B;&#x5E8F;&#x4E2D;&#x7ED9;&#x5B9A;&#x7684;&#x4F4D;&#x7F6E;&#x58F0;&#x660E;&#x7A0B;&#x5E8F;&#x5269;&#x4E0B;&#x7684;&#x90E8;&#x5206;&#x3002;&#x53EF;&#x4EE5;&#x5728;&#x7A0B;&#x5E8F;&#x6267;&#x884C;&#x7684;&#x4EFB;&#x610F;&#x65F6;&#x523B;&#x6355;&#x83B7;continuation&#x3002;&#x548C;&#x5176;&#x5B83;&#x8FC7;&#x7A0B;&#x4E00;&#x6837;&#xFF0C;continuation&#x4E5F;&#x662F;&#x7B2C;&#x4E00;&#x7C7B;&#x6570;&#x636E;&#x5BF9;&#x8C61;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;&#x521B;&#x5EFA;&#x540E;&#x968F;&#x65F6;&#x8C03;&#x7528;&#x3002;&#x4E0D;&#x7BA1;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x88AB;&#x8C03;&#x7528;&#xFF0C;&#x7A0B;&#x5E8F;&#x90FD;&#x4F1A;&#x7ACB;&#x5373;&#x4ECE;&#x6355;&#x83B7;&#x5B83;&#x7684;&#x4F4D;&#x7F6E;&#x5F00;&#x59CB;&#x6267;&#x884C;&#x3002;&#x901A;&#x8FC7;continuaion&#xFF0C;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x590D;&#x6742;&#x7684;&#x63A7;&#x5236;&#x673A;&#x5236;&#xFF0C;&#x5305;&#x62EC;&#x56DE;&#x6EAF;&#xFF0C;&#x591A;&#x7EBF;&#x7A0B;&#x53CA;&#x534F;&#x540C;&#x7A0B;&#x5E8F;&#x3002;</p>
<p>&#x5728;Scheme&#x4E2D;&#xFF0C;&#x901A;&#x8FC7;&#x7F16;&#x5199;&#x8F6C;&#x6362;&#x8FC7;&#x7A0B;&#xFF0C;&#x786E;&#x5B9A;&#x6BCF;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x8BED;&#x6CD5;&#x5F62;&#x5F0F;&#x5982;&#x4F55;&#x6620;&#x5C04;&#x5230;&#x73B0;&#x6709;&#x7684;&#x8BED;&#x6CD5;&#x5F62;&#x5F0F;&#x4E2D;&#xFF0C;&#x7A0B;&#x5E8F;&#x5458;&#x53EF;&#x4EE5;&#x5B9A;&#x4E49;&#x65B0;&#x7684;&#x8BED;&#x6CD5;&#x5F62;&#x5F0F;&#xFF0C;&#x6216;&#x8005;&#x8BF4;<em>&#x8BED;&#x6CD5;&#x62D3;&#x5C55;</em>&#x3002;&#x8FD9;&#x4E9B;&#x8F6C;&#x6362;&#x8FC7;&#x7A0B;&#x53EF;&#x4EE5;&#x7528;Scheme&#x5199;&#xFF0C;&#x8FD9;&#x5F97;&#x529B;&#x4E8E;Scheme&#x662F;&#x65B9;&#x4FBF;&#x7684;&#x9AD8;&#x7EA7;&#x6A21;&#x5F0F;&#x8BED;&#x8A00;&#xFF0C;&#x53EF;&#x4EE5;&#x81EA;&#x52A8;&#x6267;&#x884C;&#x8BED;&#x6CD5;&#x68C0;&#x67E5;&#xFF0C;&#x89E3;&#x6790;&#x8F93;&#x5165;&#x5E76;&#x91CD;&#x65B0;&#x6784;&#x9020;&#x8F93;&#x51FA;&#x3002;&#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8F6C;&#x6362;&#x8FC7;&#x7A0B;&#x4FDD;&#x6301;&#x8BCD;&#x6CD5;&#x4F5C;&#x7528;&#x57DF;&#xFF0C;&#x4F46;&#x662F;&#x7A0B;&#x5E8F;&#x5458;&#x53EF;&#x4EE5;&#x63A7;&#x5236;&#x6240;&#x6709;&#x6807;&#x8BC6;&#x7B26;&#x5728;&#x8F6C;&#x6362;&#x540E;&#x7684;&#x4F5C;&#x7528;&#x57DF;&#x3002;&#x8BED;&#x6CD5;&#x6269;&#x5C55;&#x5F88;&#x6709;&#x7528;&#xFF0C;&#x53EF;&#x4EE5;&#x5B9A;&#x4E49;&#x65B0;&#x7684;&#x8BED;&#x8A00;&#x7ED3;&#x6784;&#xFF0C;&#x7528;&#x6765;&#x6A21;&#x4EFF;&#x5176;&#x5B83;&#x8BED;&#x8A00;&#x91CC;&#x7684;&#x8BED;&#x6CD5;&#x7ED3;&#x6784;&#xFF0C;&#x4ECE;&#x800C;&#x8FBE;&#x5230;&#x5185;&#x8054;&#x4EE3;&#x7801;&#x7684;&#x6548;&#x7387;&#xFF0C;&#x751A;&#x81F3;&#x7528;Scheme&#x6A21;&#x62DF;&#x6574;&#x4E2A;&#x8BED;&#x8A00;&#x3002;&#x5927;&#x578B;&#x7684;Scheme&#x7A0B;&#x5E8F;&#x4E00;&#x822C;&#x6DF7;&#x5408;&#x4F7F;&#x7528;&#x8BED;&#x6CD5;&#x6269;&#x5C55;&#x548C;&#x8FC7;&#x7A0B;&#x5B9A;&#x4E49;&#x3002;</p>
<p>Scheme&#x4ECE;Lisp&#x8BED;&#x8A00;&#x6F14;&#x5316;&#x800C;&#x6765;&#xFF0C;&#x662F;Lisp&#x7684;&#x65B9;&#x8A00;&#x4E4B;&#x4E00;&#x3002;Scheme&#x4ECE;Lisp&#x90A3;&#x91CC;&#x7EE7;&#x627F;&#x4E86;&#x8BB8;&#x591A;&#x4E1C;&#x897F;&#xFF1A;&#x5C06;&#x503C;&#x4F5C;&#x4E3A;&#x7B2C;&#x4E00;&#x7C7B;&#x5BF9;&#x8C61;&#x7684;&#x5904;&#x7406;&#x65B9;&#x5F0F;&#xFF0C;&#x4E00;&#x4E9B;&#x91CD;&#x8981;&#x7684;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x2014;&#x2014;&#x5305;&#x62EC;&#x7B26;&#x53F7;&#x548C;&#x5217;&#x8868;&#xFF0C;&#x5C06;&#x7A0B;&#x5E8F;&#x8868;&#x793A;&#x4E3A;&#x5BF9;&#x8C61;&#x7B49;&#x3002;&#x8BCD;&#x6CD5;&#x4F5C;&#x7528;&#x57DF;&#x53CA;&#x5757;&#x7ED3;&#x6784;&#x7EE7;&#x627F;&#x81EA;Algol 60[21]&#x3002;&#x5728;Lisp&#x7684;&#x65B9;&#x8A00;&#x4E2D;&#xFF0C;Scheme&#x7B2C;&#x4E00;&#x4E2A;&#x652F;&#x6301;&#x8BCD;&#x6CD5;&#x4F5C;&#x7528;&#x57DF;&#x3001;&#x5757;&#x7ED3;&#x6784;&#x3001;&#x7B2C;&#x4E00;&#x7C7B;&#x8FC7;&#x7A0B;&#x3001;&#x5C3E;&#x9012;&#x5F52;&#x3001;continuation&#xFF0C;&#x4EE5;&#x53CA;&#x8BCD;&#x6CD5;&#x4F5C;&#x7528;&#x57DF;&#x9650;&#x5B9A;&#x7684;&#x8BED;&#x6CD5;&#x6269;&#x5C55;&#x3002;</p>
<p>Common Lisp[27]&#x548C;Scheme&#x662F;Lisp&#x7684;&#x73B0;&#x4EE3;&#x65B9;&#x8A00;&#xFF0C;&#x5E76;&#x4E14;&#x76F8;&#x4E92;&#x5F71;&#x54CD;&#x3002;Common Lisp&#x50CF;Scheme&#x4E00;&#x6837;&#xFF0C;&#x4E0D;&#x540C;&#x4E8E;&#x4EE5;&#x524D;&#x7684;Lisp&#x8BED;&#x8A00;&#xFF0C;&#x91C7;&#x7528;&#x4E86;&#x8BCD;&#x6CD5;&#x4F5C;&#x7528;&#x57DF;&#x548C;&#x7B2C;&#x4E00;&#x7C7B;&#x8FC7;&#x7A0B;&#xFF0C;&#x4E0D;&#x8FC7;&#x5B83;&#x7684;&#x8BED;&#x6CD5;&#x6269;&#x5C55;&#x4E0D;&#x9075;&#x5B88;&#x8BCD;&#x6CD5;&#x4F5C;&#x7528;&#x57DF;&#x3002;Common Lisp&#x5BF9;&#x8FC7;&#x7A0B;&#x7684;&#x6C42;&#x503C;&#x89C4;&#x5219;&#x548C;&#x5176;&#x5B83;&#x5BF9;&#x8C61;&#x7684;&#x89C4;&#x5219;&#x4E0D;&#x540C;&#xFF0C;&#x5B83;&#x5728;&#x4E00;&#x4E2A;&#x5355;&#x72EC;&#x7684;&#x547D;&#x540D;&#x7A7A;&#x95F4;&#x91CC;&#x7EF4;&#x62A4;&#x8FC7;&#x7A0B;&#x53D8;&#x91CF;&#xFF0C;&#x4ECE;&#x800C;&#x9650;&#x5236;&#x4E86;&#x5C06;&#x8FC7;&#x7A0B;&#x4F5C;&#x4E3A;&#x7B2C;&#x4E00;&#x7C7B;&#x5BF9;&#x8C61;&#x3002;Common Lisp&#x4E5F;&#x4E0D;&#x652F;&#x6301;continuation&#x548C;&#x5C3E;&#x8C03;&#x7528;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x652F;&#x6301;&#x51E0;&#x79CD;Scheme&#x6CA1;&#x6709;&#x7684;&#x63A7;&#x5236;&#x7ED3;&#x6784;&#x3002;&#x8FD9;&#x4E24;&#x79CD;&#x8BED;&#x8A00;&#x6BD4;&#x8F83;&#x76F8;&#x4F3C;&#xFF0C;Common Lisp&#x6709;&#x66F4;&#x591A;&#x4E13;&#x95E8;&#x7684;&#x7ED3;&#x6784;&#xFF0C;&#x800C; Scheme&#x5305;&#x62EC;&#x66F4;&#x591A;&#x901A;&#x7528;&#x6A21;&#x5757;&#xFF0C;&#x53EF;&#x4EE5;&#x6784;&#x5EFA;&#x5404;&#x79CD;&#x7ED3;&#x6784;&#x3002;</p>
<p>&#x672C;&#x7AE0;&#x5269;&#x4E0B;&#x7684;&#x90E8;&#x5206;&#x63CF;&#x8FF0;Scheme&#x7684;&#x8BED;&#x6CD5;&#x3001;&#x547D;&#x540D;&#x89C4;&#x7EA6;&#xFF0C;&#x4EE5;&#x53CA;&#x8D2F;&#x7A7F;&#x4E0E;&#x672C;&#x4E66;&#x4E2D;&#x7684;&#x6392;&#x7248;&#x89C4;&#x5219;&#x3002;</p>
<h1 id="11-scheme&#x8BED;&#x6CD5;">1.1 Scheme&#x8BED;&#x6CD5;</h1>
<p>Scheme&#x7A0B;&#x5E8F;&#x5305;&#x62EC;&#x5173;&#x952E;&#x5B57;&#x3001;&#x53D8;&#x91CF;&#x3001;&#x7ED3;&#x6784;&#x5F62;&#x5F0F;&#x3001;&#x5E38;&#x6570;&#xFF08;&#x6570;&#x5B57;&#xFF0C;&#x5B57;&#x7B26;&#xFF0C;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x5E26;&#x5F15;&#x53F7;&#x7684;&#x5411;&#x91CF;&#xFF0C;&#x5E26;&#x5F15;&#x53F7;&#x7684;&#x5217;&#x8868;&#xFF0C;&#x5E26;&#x5F15;&#x53F7;&#x7684;&#x7B26;&#x53F7;&#x7B49;&#xFF09;&#x3001;&#x7A7A;&#x683C;&#x548C;&#x6CE8;&#x91CA;&#x3002;</p>
<p>&#x5173;&#x952E;&#x5B57;&#x3001;&#x53D8;&#x91CF;&#x548C;&#x7B26;&#x53F7;&#x7EDF;&#x79F0;&#x6807;&#x8BC6;&#x7B26;&#x3002;&#x6807;&#x8BC6;&#x7B26;&#x53EF;&#x4EE5;&#x7531;&#x5B57;&#x6BCD;&#xFF0C;&#x6570;&#x5B57;&#x548C;&#x67D0;&#x4E9B;&#x7279;&#x6B8A;&#x5B57;&#x7B26;&#x7EC4;&#x6210;&#xFF0C;&#x5305;&#x62EC;<code>&#xFF1F; &#xFF01; &#x3002; + - * / &lt; = &gt; &#xFF1A; $ &#xFF05; ^ &amp; _  &#x301C; @</code>&#xFF0C;&#x4EE5;&#x53CA;&#x5176;&#x5B83;Unicode&#x5B57;&#x7B26;&#x3002;&#x6807;&#x8BC6;&#x7B26;&#x4E0D;&#x80FD;&#x4EE5;@&#x7B26;&#x53F7;&#x5F00;&#x5934;&#xFF0C;&#x4E5F;&#x4E0D;&#x80FD;&#x4EE5;&#x4EFB;&#x4F55;&#x524D;&#x9762;&#x53EF;&#x4EE5;&#x52A0;&#x6570;&#x5B57;&#x7684;&#x5B57;&#x7B26;&#x5F00;&#x5934;&#xFF0C;&#x4F8B;&#x5982;&#xFF0C;&#x6570;&#x5B57;&#xFF0C;&#x52A0;&#x53F7;&#xFF0C;&#x51CF;&#x53F7;&#x6216;&#x8005;&#x5C0F;&#x6570;&#x70B9;&#x3002;&#x52A0;&#x53F7;&#x3001;&#x51CF;&#x53F7;&#x3001;&#x7701;&#x7565;&#x53F7;&#x548C;&#x4EE5;-&gt;&#x5F00;&#x5934;&#x7684;&#x662F;&#x4F8B;&#x5916;&#xFF0C;&#x5B83;&#x4EEC;&#x90FD;&#x662F;&#x6709;&#x6548;&#x7684;&#x6807;&#x8BC6;&#x7B26;&#x3002;&#x4F8B;&#x5982;&#xFF0C;<code>hi,Hello,n,x,x3,x + 2,&#xFF1F;$&amp;* !!!</code>&#x90FD;&#x662F;&#x6807;&#x8BC6;&#x7B26;&#x3002;&#x6807;&#x8BC6;&#x7B26;&#x7531;&#x7A7A;&#x683C;&#x3001;&#x6CE8;&#x91CA;&#x3001;&#x62EC;&#x53F7;&#x3001;&#x65B9;&#x62EC;&#x53F7;&#x3001;&#x5B57;&#x7B26;&#x4E32;&#x3001;&#x5F15;&#x53F7;&#x3001;&#x53CC;&#x5F15;&#x53F7;&#x3001;&#x4E95;&#x53F7;&#x5206;&#x5272;&#x3002;&#x5206;&#x9694;&#x7B26;&#x6216;&#x8005;&#x5176;&#x5B83;&#x4EFB;&#x4F55;Unicode&#x5B57;&#x7B26;&#x90FD;&#x53EF;&#x4EE5;&#x88AB;&#x8F6C;&#x4E49;&#x4E3A;<code>\xsv;</code>&#x7684;&#x5F62;&#x5F0F;&#xFF0C;&#x5176;&#x4E2D;<code>sv</code>&#x662F;&#x5B57;&#x7B26;&#x7684;&#x5341;&#x516D;&#x8FDB;&#x5236;&#x6807;&#x91CF;&#x503C;&#x3002;</p>
<p>Scheme&#x6807;&#x8BC6;&#x7B26;&#x6CA1;&#x6709;&#x957F;&#x5EA6;&#x9650;&#x5236;&#xFF1B;&#x7A0B;&#x5E8F;&#x5458;&#x9700;&#x8981;&#x591A;&#x957F;&#x5C31;&#x80FD;&#x5199;&#x591A;&#x957F;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x957F;&#x6807;&#x8BC6;&#x7B26;&#x4E0D;&#x80FD;&#x66FF;&#x4EE3;&#x6CE8;&#x91CA;&#xFF0C;&#x9891;&#x7E41;&#x4F7F;&#x7528;&#x4F1A;&#x4F7F;&#x7A0B;&#x5E8F;&#x96BE;&#x4EE5;&#x6392;&#x7248;&#xFF0C;&#x4E0D;&#x597D;&#x9605;&#x8BFB;&#x3002;&#x4E00;&#x4E2A;&#x597D;&#x7684;&#x539F;&#x5219;&#x662F;&#xFF0C;&#x5F53;&#x4F5C;&#x7528;&#x57DF;&#x8F83;&#x5C0F;&#x65F6;&#xFF0C;&#x7528;&#x77ED;&#x6807;&#x8BC6;&#x7B26;&#xFF0C;&#x800C;&#x5F53;&#x4F5C;&#x7528;&#x4E8E;&#x5927;&#x65F6;&#xFF0C;&#x7528;&#x957F;&#x6807;&#x8BC6;&#x7B26;&#x3002;</p>
<p>&#x6807;&#x8BC6;&#x7B26;&#x53EF;&#x4EE5;&#x5927;&#x5C0F;&#x5199;&#x6DF7;&#x7528;&#xFF0C;&#x5E76;&#x4E14;&#x533A;&#x5206;&#x5927;&#x5C0F;&#x5199;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x5373;&#x4F7F;&#x4E24;&#x4E2A;&#x6807;&#x8BC6;&#x7B26;&#x4EC5;&#x5728;&#x5927;&#x5C0F;&#x5199;&#x4E0A;&#x6709;&#x6240;&#x4E0D;&#x540C;&#xFF0C;&#x5B83;&#x4EEC;&#x4E5F;&#x4E0D;&#x4E00;&#x6837;&#x3002;&#x4F8B;&#x5982;&#xFF0C;<code>abcde</code>&#xFF0C;<code>Abcde</code>&#xFF0C;<code>AbCdE</code>&#x548C;<code>ABCDE</code>&#x90FD;&#x662F;&#x4E0D;&#x540C;&#x7684;&#x6807;&#x8BC6;&#x7B26;&#x3002;&#x8FD9;&#x8DDF;&#x4EE5;&#x524D;&#x7684;&#x6807;&#x51C6;&#x4E0D;&#x540C;&#x3002;</p>
<p>&#x7ED3;&#x6784;&#x5F62;&#x5F0F;&#x548C;&#x5217;&#x8868;&#x5E38;&#x91CF;&#x62EC;&#x5728;&#x62EC;&#x53F7;&#x91CC;&#xFF0C;&#x4F8B;&#x5982;<code>(a b c)</code>&#x548C;<code>(*(-x 2)y)</code>&#x3002;&#x7A7A;&#x5217;&#x8868;&#x88AB;&#x5199;&#x4E3A; <code>()</code>&#x3002; &#x5339;&#x914D;&#x7684;&#x4E2D;&#x62EC;&#x53F7;<code>[]</code>&#x53EF;&#x4EE5;&#x4EE3;&#x66FF;&#x62EC;&#x53F7;&#xFF0C;&#x901A;&#x5E38;&#x7528;&#x4E8E;&#x67D0;&#x4E9B;&#x6807;&#x51C6;&#x8BED;&#x6CD5;&#x5F62;&#x5F0F;&#x7684;&#x5B50;&#x8868;&#x8FBE;&#x5F0F;&#xFF0C;&#x53EF;&#x4EE5;&#x63D0;&#x9AD8;&#x53EF;&#x8BFB;&#x6027;&#xFF0C;&#x6574;&#x672C;&#x4E66;&#x4E2D;&#x7684;&#x793A;&#x4F8B;&#x5C31;&#x662F;&#x8FD9;&#x6837;&#x5199;&#x7684;&#x3002;&#x5411;&#x91CF;&#x7684;&#x5199;&#x6CD5;&#x4E0E;&#x5217;&#x8868;&#x7C7B;&#x4F3C;&#xFF0C;&#x4E0D;&#x540C;&#x4E4B;&#x5904;&#x5728;&#x4E8E;&#xFF0C;&#x5411;&#x91CF;&#x4E4B;&#x524D;&#x5E26;&#x6709;&#xFF03;&#xFF0C;&#x4F8B;&#x5982;<code>&#xFF03;&#xFF08;&#x8FD9;&#x662F;&#x7B26;&#x53F7;&#x7684;&#x5411;&#x91CF;&#xFF09;</code>&#x3002;&#x5B57;&#x8282;&#x5411;&#x91CF;&#x88AB;&#x5199;&#x4E3A;&#x65E0;&#x7B26;&#x53F7;&#x5B57;&#x8282;&#x503C;&#xFF08;&#x5728;0&#x5230;255&#x4E4B;&#x95F4;&#x7684;&#x6574;&#x6570;&#xFF09;&#x7684;&#x5E8F;&#x5217;&#xFF0C;&#x5E76;&#x7528;<code>&#xFF03;vu8(</code>&#x548C;<code>)</code>&#x62EC;&#x8D77;&#x6765;&#xFF0C;&#x4F8B;&#x5982;<code>&#xFF03;vu8(3 250 45 73)</code>&#x3002;</p>
<p>&#x5B57;&#x7B26;&#x4E32;&#x7528;&#x53CC;&#x5F15;&#x53F7;&#x5F15;&#x8D77;&#x6765;&#xFF0C;&#x4F8B;&#x5982;<code>&quot;I am a string&quot;</code>&#x3002;&#x5B57;&#x7B26;&#x4EE5;<code>&#xFF03;\</code>&#x5F00;&#x5934;&#xFF0C;&#x4F8B;&#x5982;<code>&#xFF03;\a</code>&#x3002;&#x5728;&#x6807;&#x8BC6;&#x7B26;&#x4E2D;&#x65F6;&#xFF0C;&#x5B57;&#x7B26;&#x7B26;&#x5E38;&#x91CF;&#x548C;&#x5B57;&#x7B26;&#x4E32;&#x5E38;&#x91CF;&#x7684;&#x5927;&#x5C0F;&#x5199;&#x5F88;&#x91CD;&#x8981;&#x3002;&#x6570;&#x5B57;&#x53EF;&#x4EE5;&#x5199;&#x4E3A;&#x6574;&#x6570;&#xFF0C;&#x4F8B;&#x5982;<code>-123</code>&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x5199;&#x6210;&#x5206;&#x6570;&#xFF0C;&#x5982;<code>1/2</code>&#xFF0C;&#x5199;&#x6210;&#x6D6E;&#x70B9;&#x6570;&#x6216;&#x8005;&#x79D1;&#x5B66;&#x8BA1;&#x6570;&#x6CD5;&#xFF0C;&#x5982;<code>1.3</code>&#x6216;&#x8005;<code>1e23</code>&#xFF0C;&#x6216;&#x8005;&#x5199;&#x6210;&#x4EE5;&#x76F4;&#x89D2;&#x5750;&#x6807;&#x7CFB;&#x6216;&#x6781;&#x5750;&#x6807;&#x8868;&#x793A;&#x7684;&#x590D;&#x6570;&#xFF0C;&#x4F8B;&#x5982;<code>1.3-2.7i</code>&#xFF0C;<code>-1.2@73</code>&#x3002;&#x5728;&#x6570;&#x5B57;&#x7684;&#x8BED;&#x6CD5;&#x4E2D;&#xFF0C;&#x5927;&#x5C0F;&#x5199;&#x5E76;&#x4E0D;&#x91CD;&#x8981;&#x3002;&#x5E03;&#x5C14;&#x503C;&#x4EE3;&#x8868;&#x771F;&#x548C;&#x5047;&#xFF0C;&#x5199;&#x6210;<code>#t</code>&#x548C;<code>#f</code>&#x3002;&#x5728;Scheme&#x7684;&#x6761;&#x4EF6;&#x8868;&#x8FBE;&#x5F0F;&#x4E2D;&#xFF0C;<code>#f</code>&#x4E3A;&#x5047;&#xFF0C;<code>#f</code>&#x5916;&#x7684;&#x5176;&#x4ED6;&#x5BF9;&#x8C61;&#x90FD;&#x4E3A;&#x771F;&#xFF0C;&#x6240;&#x4EE5;<code>3,0,(),&quot;false&quot;,nill</code>&#x90FD;&#x4E3A;&#x771F;&#x3002;</p>
<p>&#x5728;&#x7B2C;6&#x7AE0;&#x7684;&#x5404;&#x4E2A;&#x90E8;&#x5206;&#xFF0C;&#x4EE5;&#x53CA;&#x4ECE;455&#x9875;&#x5F00;&#x59CB;&#x7684;Scheme&#x7684;&#x6B63;&#x5F0F;&#x8BED;&#x6CD5;&#x4E2D;&#xFF0C;&#x6709;&#x6BCF;&#x79CD;&#x5E38;&#x91CF;&#x8BED;&#x6CD5;&#x7684;&#x8BE6;&#x7EC6;&#x4FE1;&#x606F;&#x3002;</p>
<p>Scheme&#x8868;&#x8FBE;&#x5F0F;&#x53EF;&#x4EE5;&#x8DE8;&#x884C;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x663E;&#x5F0F;&#x7EC8;&#x6B62;&#x7B26;&#x3002;&#x56E0;&#x4E3A;&#x8868;&#x8FBE;&#x5F0F;&#x4E4B;&#x95F4;&#x7684;&#x7A7A;&#x767D;&#x5B57;&#x7B26;&#xFF08;&#x7A7A;&#x683C;&#x548C;&#x6362;&#x884C;&#x7B26;&#xFF09;&#x5E76;&#x4E0D;&#x91CD;&#x8981;&#xFF0C;&#x5E94;&#x8BE5;&#x7F29;&#x8FDB;Scheme&#x7A0B;&#x5E8F;&#x4EE3;&#x7801;&#xFF0C;&#x5C55;&#x793A;&#x4EE3;&#x7801;&#x7ED3;&#x6784;&#xFF0C;&#x4ECE;&#x800C;&#x589E;&#x52A0;&#x53EF;&#x8BFB;&#x6027;&#x3002;&#x6CE8;&#x91CA;&#x53EF;&#x4EE5;&#x51FA;&#x73B0;&#x5728;Scheme&#x7A0B;&#x5E8F;&#x7684;&#x4EFB;&#x4F55;&#x4E00;&#x884C;&#xFF0C;&#x5728;&#x5206;&#x53F7;&#x548C;&#x884C;&#x5C3E;&#x4E4B;&#x95F4;&#x3002;&#x89E3;&#x91CA;&#x7279;&#x5B9A;&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x6CE8;&#x91CA;&#x901A;&#x5E38;&#x653E;&#x5728;&#x540C;&#x4E00;&#x7F29;&#x8FDB;&#x7EA7;&#x522B;&#x4E0A;&#xFF0C;&#x5199;&#x5728;&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x524D;&#x4E00;&#x884C;&#x3002;&#x89E3;&#x91CA;&#x8FC7;&#x7A0B;&#x6216;&#x4E00;&#x7EC4;&#x8FC7;&#x7A0B;&#x7684;&#x6CE8;&#x91CA;&#x901A;&#x5E38;&#x653E;&#x5728;&#x8FC7;&#x7A0B;&#x4E4B;&#x524D;&#xFF0C;&#x4E0D;&#x7F29;&#x8FDB;&#x3002;&#x524D;&#x9762;&#x901A;&#x5E38;&#x4F7F;&#x7528;&#x591A;&#x4E2A;&#x6CE8;&#x91CA;&#x5B57;&#x7B26;&#xFF0C;&#x4F8B;&#x5982;<code>;;; &#x4E0B;&#x9762;&#x7684;&#x8FC7;&#x7A0B;...</code>&#x3002;</p>
<p>Scheme&#x4E5F;&#x652F;&#x6301;&#x4E24;&#x79CD;&#x5176;&#x4ED6;&#x5F62;&#x5F0F;&#x7684;&#x6CE8;&#x91CA;&#xFF1A;&#x5757;&#x6CE8;&#x91CA;&#x548C;&#x6570;&#x636E;&#x6CE8;&#x91CA; (Datum Comments)&#x3002;&#x5757;&#x6CE8;&#x91CA;&#x7528;<code>&#xFF03;|</code>&#x548C;<code>|&#xFF03;</code>&#x5206;&#x5272;&#xFF0C;&#x5E76;&#x4E14;&#x53EF;&#x4EE5;&#x5D4C;&#x5957;&#x3002;&#x6570;&#x636E;&#x6CE8;&#x91CA;&#x7531;&#x524D;&#x7F00;<code>&#xFF03;;</code>&#x548C;&#x8981;&#x8F93;&#x51FA;&#x7684;&#x6570;&#x636E;&#x7EC4;&#x6210;&#x3002;&#x6570;&#x636E;&#x6CE8;&#x91CA;&#x901A;&#x5E38;&#x7528;&#x4E8E;&#x6CE8;&#x91CA;&#x5355;&#x4E2A;&#x5B9A;&#x4E49;&#x6216;&#x8868;&#x8FBE;&#x5F0F;&#x3002;&#x4F8B;&#x5982;&#xFF0C;<code>(Three #;(not four) elements list)</code> &#x3002;&#x6570;&#x636E;&#x6CE8;&#x91CA;&#x4E5F;&#x53EF;&#x4EE5;&#x5D4C;&#x5957;&#xFF0C;<code>#;#;(a)(b)</code>&#x628A;<code>(a)</code>&#x548C;<code>(b)</code>&#x90FD;&#x6CE8;&#x91CA;&#x4E86;&#x3002;</p>
<p>&#x67D0;&#x4E9B;Scheme&#x503C;&#xFF0C;&#x4F8B;&#x5982;&#x8FC7;&#x7A0B;&#x548C;&#x7AEF;&#x53E3;&#xFF0C;&#x6CA1;&#x6709;&#x6807;&#x51C6;&#x7684;&#x8F93;&#x51FA;&#x5F62;&#x5F0F;&#xFF0C;&#x56E0;&#x6B64;&#x5728;&#x7A0B;&#x5E8F;&#x7684;&#x8F93;&#x51FA;&#x8BED;&#x6CD5;&#x4E2D;&#x6C38;&#x8FDC;&#x4E0D;&#x4F1A;&#x663E;&#x793A;&#x4E3A;&#x5E38;&#x91CF;&#x3002;&#x5728;&#x663E;&#x793A;&#x8FD4;&#x56DE;&#x8FD9;&#x7C7B;&#x503C;&#x7684;&#x8FC7;&#x7A0B;&#x7684;&#x8F93;&#x51FA;&#x65F6;&#xFF0C;&#x672C;&#x4E66;&#x4F7F;&#x7528;&#x4E86;&#x7B26;&#x53F7;<code>&#xFF03;&lt;description&gt;</code>&#xFF0C;&#x4F8B;&#x5982;<code>&#xFF03;&lt;procedure&gt;</code>&#x6216;<code>&#xFF03;&lt;port&gt;</code>&#x3002;</p>
<h1 id="12-scheme&#x547D;&#x540D;&#x89C4;&#x5B9A;">1.2 Scheme&#x547D;&#x540D;&#x89C4;&#x5B9A;</h1>
<p>Scheme&#x7684;&#x547D;&#x540D;&#x89C4;&#x5B9A;&#x5F88;&#x6709;&#x89C4;&#x5F8B;&#x3002;&#x4E0B;&#x9762;&#x662F;&#x547D;&#x540D;&#x89C4;&#x5B9A;&#xFF1A;</p>
<ul>
<li>&#x4EE5;&#x95EE;&#x53F7;&#x7ED3;&#x5C3E;&#x7684;&#x8C13;&#x8BCD;&#xFF0C;&#x4EE3;&#x8868;&#x8FD4;&#x56DE;&#x6B63;&#x786E;&#x6216;&#x9519;&#x8BEF;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x4F8B;&#x5982;<code>eq?</code>&#xFF0C;<code>zero?</code>&#x548C;<code>string=?</code>&#x3002;&#x5E38;&#x7528;&#x7684;&#x6570;&#x5B57;&#x6BD4;&#x8F83;&#x7B26;&#x53F7;<code>=,&lt;,&gt;,&lt;=,&gt;=</code>&#x662F;&#x4F8B;&#x5916;&#x3002;</li>
<li>&#x7C7B;&#x578B;&#x8C13;&#x8BCD;&#xFF0C;&#x4F8B;&#x5982;<code>pair?</code>&#xFF0C;&#x7531;&#x7C7B;&#x578B;&#x540D;&#x52A0;&#x4E0A;&#x95EE;&#x53F7;&#x7EC4;&#x6210;&#x3002;</li>
<li>&#x5927;&#x591A;&#x6570;&#x5B57;&#x7B26;&#x3001;&#x5B57;&#x7B26;&#x4E32;&#x548C;&#x5411;&#x91CF;&#x8FC7;&#x7A0B;&#x7684;&#x540D;&#x79F0;&#xFF0C;&#x90FD;&#x4EE5;&#x524D;&#x7F00;<code>char-</code>&#xFF0C;<code>string-</code>&#x548C;<code>vector-</code>&#x5F00;&#x5934;&#xFF0C;&#x4F8B;&#x5982;<code>string-append</code>&#x3002;&#x67D0;&#x4E9B;&#x5217;&#x8868;&#x8FC7;&#x7A0B;&#x7684;&#x540D;&#x79F0;&#x4EE5;<code>list-</code>&#x5F00;&#x5934;&#xFF0C;&#x4F46;&#x5927;&#x591A;&#x6570;&#x4E0D;&#x662F;&#x3002;</li>
<li>&#x7C7B;&#x578B;&#x8F6C;&#x6362;&#x8FC7;&#x7A0B;&#x7684;&#x540D;&#x79F0;&#x5199;&#x4E3A;<code>&#x7C7B;&#x578B;1-&gt;&#x7C7B;&#x578B;2</code>&#xFF0C;&#x4F8B;&#x5982;<code>vector-&gt;list</code>&#x3002;</li>
<li>&#x6709;&#x526F;&#x4F5C;&#x7528;&#x7684;&#x8FC7;&#x7A0B;&#x548C;&#x8BED;&#x6CD5;&#x5F62;&#x5F0F;&#x7684;&#x540D;&#x79F0;&#x4EE5;&#x611F;&#x53F9;&#x53F7;&#x7ED3;&#x5C3E;&#x3002;&#x6BD4;&#x5982;<code>set!</code>&#x548C;<code>vector-set!</code>&#x3002;&#x4ECE;&#x6280;&#x672F;&#x4E0A;&#x8BF4;&#xFF0C;&#x6267;&#x884C;&#x8F93;&#x5165;&#x8F93;&#x51FA;&#x7684;&#x8FC7;&#x7A0B;&#x4E5F;&#x6709;&#x526F;&#x4F5C;&#x7528;&#xFF0C;&#x4F46;&#x5B83;&#x4EEC;&#x4E0D;&#x9075;&#x5B88;&#x8FD9;&#x6761;&#x89C4;&#x5219;&#x3002;</li>
</ul>
<p>&#x7A0B;&#x5E8F;&#x5458;&#x5E94;&#x5C3D;&#x53EF;&#x80FD;&#x5728;&#x81EA;&#x5DF1;&#x7684;&#x4EE3;&#x7801;&#x4E2D;&#x9075;&#x5B88;&#x8FD9;&#x4E9B;&#x89C4;&#x5B9A;&#x3002;</p>
<h1 id="13-&#x6392;&#x7248;&#x548C;&#x7B26;&#x53F7;&#x89C4;&#x5B9A;">1.3 &#x6392;&#x7248;&#x548C;&#x7B26;&#x53F7;&#x89C4;&#x5B9A;</h1>
<p>&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x6807;&#x51C6;&#x8FC7;&#x7A0B;&#x6216;&#x8005;&#x8BED;&#x6CD5;&#x5F62;&#x5F0F;&#x7684;&#x552F;&#x4E00;&#x529F;&#x80FD;&#x662F;&#x4EA7;&#x751F;&#x4E00;&#x4E9B;&#x526F;&#x4F5C;&#x7528;&#x2014;&#x2014;&#x6BD4;&#x5982;<code>set!</code>&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x7684;&#x8FD4;&#x56DE;&#x503C;&#x662F;<em>&#x672A;&#x5B9A;&#x4E49;&#x7684;</em>&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x5B9E;&#x73B0;&#x53EF;&#x4EE5;&#x8FD4;&#x56DE;&#x4EFB;&#x4F55;&#x6570;&#x503C;&#x3001;&#x4EFB;&#x4F55;Scheme&#x5BF9;&#x8C61;&#xFF0C;&#x4EE5;&#x4F5C;&#x4E3A;&#x8FC7;&#x7A0B;&#x6216;&#x8BED;&#x6CD5;&#x5F62;&#x5F0F;&#x7684;&#x503C;&#x3002;&#x4E0D;&#x8981;&#x6307;&#x671B;&#x4E0D;&#x540C;&#x5B9E;&#x73B0;&#x8FD4;&#x56DE;&#x76F8;&#x540C;&#x7684;&#x503C;&#xFF0C;&#x540C;&#x4E00;&#x5B9E;&#x73B0;&#x7684;&#x4E0D;&#x540C;&#x7248;&#x672C;&#x4E5F;&#x4E0D;&#x7528;&#x6307;&#x671B;&#xFF0C;&#x751A;&#x81F3;&#x662F;&#x8FC7;&#x7A0B;&#x6216;&#x8BED;&#x6CD5;&#x5F62;&#x5F0F;&#x7684;&#x4E24;&#x6B21;&#x4F7F;&#x7528;&#x4E2D;&#xFF0C;&#x503C;&#x90FD;&#x53EF;&#x80FD;&#x4E0D;&#x4E00;&#x6837;&#x3002;&#x67D0;&#x4E9B;Scheme&#x7CFB;&#x7EDF;&#x4F1A;&#x4F7F;&#x7528;&#x7279;&#x6B8A;&#x5BF9;&#x8C61;&#x6765;&#x8868;&#x793A;&#x672A;&#x6307;&#x5B9A;&#x7684;&#x503C;&#x3002;&#x4EA4;&#x4E92;&#x5F0F;Scheme&#x7CFB;&#x7EDF;&#x901A;&#x5E38;&#x4F1A;&#x7981;&#x6B62;&#x8F93;&#x51FA;&#x6B64;&#x5BF9;&#x8C61;&#xFF0C;&#x56E0;&#x6B64;&#x8FD4;&#x56DE;&#x672A;&#x6307;&#x5B9A;&#x503C;&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x503C;&#x65E0;&#x6CD5;&#x8F93;&#x51FA;&#x3002;</p>
<p>&#x867D;&#x7136;&#x5927;&#x591A;&#x6570;&#x6807;&#x51C6;&#x8FC7;&#x7A0B;&#x53EA;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x503C;&#xFF0C;&#x4F46;&#x4F7F;&#x7528;5.8&#x8282;&#x4E2D;&#x63CF;&#x8FF0;&#x7684;&#x673A;&#x5236;&#xFF0C;Scheme&#x8FC7;&#x7A0B;&#x53EF;&#x4EE5;&#x4E0D;&#x8FD4;&#x56DE;&#x503C;&#xFF0C;&#x6216;&#x8005;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x3001;&#x591A;&#x4E2A;&#xFF0C;&#x751A;&#x81F3;&#x53EF;&#x53D8;&#x6570;&#x91CF;&#x7684;&#x503C;&#x3002;&#x5982;&#x679C;&#x67D0;&#x4E9B;&#x6807;&#x51C6;&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x5B50;&#x8868;&#x8FBE;&#x5F0F;&#x4E4B;&#x4E00;&#x80FD;&#x6C42;&#x591A;&#x4E2A;&#x503C;&#xFF0C;&#x6BD4;&#x5982;&#x8C03;&#x7528;&#x8FD4;&#x56DE;&#x591A;&#x503C;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x5219;&#x5B83;&#x4EEC;&#x4E5F;&#x53EF;&#x4EE5;&#x6C42;&#x591A;&#x4E2A;&#x503C;&#x3002;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4E00;&#x822C;&#x8BF4;&#x8868;&#x8FBE;&#x5F0F;&#x8FD4;&#x56DE;&#x201C;&#x591A;&#x4E2A;&#x503C;&#x201D;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x7B80;&#x5355;&#x5730;&#x8BF4;&#x8FD4;&#x56DE;&#x5B50;&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x201C;&#x503C;&#x201D;&#x3002;&#x540C;&#x6837;&#xFF0C;&#x5C06;&#x8FD4;&#x56DE;&#x201C;&#x8C03;&#x7528;&#x53C2;&#x6570;&#x6240;&#x8FD4;&#x56DE;&#x7684;&#x503C;&#x201D;&#x7684;&#x6807;&#x51C6;&#x8FC7;&#x7A0B;&#x79F0;&#x4E3A;&#x201C;&#x8FD4;&#x56DE;&#x8FC7;&#x7A0B;&#x53C2;&#x6570;&#x8FD4;&#x56DE;&#x7684;&#x591A;&#x4E2A;&#x503C;&#x201D;&#x3002;</p>
<p>&#x672C;&#x4E66;&#x4F7F;&#x7528;&#x8BCD;&#x8BED;&#x201C;&#x5FC5;&#x987B;&#x201D;&#x548C;&#x201C;&#x5E94;&#x8BE5;&#x201D;&#x6765;&#x63CF;&#x8FF0;&#x7A0B;&#x5E8F;&#x8981;&#x6C42;&#xFF0C;&#x4F8B;&#x5982;&#x5728;&#x8C03;&#x7528;<code>vector-ref</code>&#x65F6;&#xFF0C;&#x8981;&#x6C42;&#x63D0;&#x4F9B;&#x5C0F;&#x4E8E;&#x77E2;&#x91CF;&#x957F;&#x5EA6;&#x7684;&#x7D22;&#x5F15; &#x3002;&#x5982;&#x679C;&#x4F7F;&#x7528;&#x201C;&#x5FC5;&#x987B;&#x201D;&#xFF0C;&#x5219;&#x8868;&#x793A;&#x8BE5;&#x8981;&#x6C42;&#x7531;&#x5B9E;&#x73B0;&#x5F3A;&#x5236;&#x6267;&#x884C;&#xFF0C;&#x5373;&#x4E00;&#x5B9A;&#x4F1A;&#x5F15;&#x53D1;&#x5F02;&#x5E38;&#xFF0C;&#x901A;&#x5E38;&#x4F7F;&#x7528;&#x6761;&#x4EF6;&#x7C7B;&#x578B;<code>&amp;assertion</code>&#x3002;&#x5982;&#x679C;&#x4F7F;&#x7528;&#x4E86;&#x201C;&#x5E94;&#x8BE5;&#x201D;&#x4E00;&#x8BCD;&#xFF0C;&#x5219;&#x53EF;&#x80FD;&#x4F1A;&#x5F15;&#x53D1;&#x5F02;&#x5E38;&#xFF0C;&#x4E5F;&#x53EF;&#x80FD;&#x4E0D;&#x4F1A;&#x3002;&#x5982;&#x679C;&#x672A;&#x5F15;&#x53D1;&#x5F02;&#x5E38;&#xFF0C;&#x5219;&#x7A0B;&#x5E8F;&#x7684;&#x884C;&#x4E3A;&#x662F;&#x672A;&#x5B9A;&#x4E49;&#x7684;&#x3002;</p>
<p>&#x77ED;&#x8BED;&#x201C;&#x8BED;&#x6CD5;&#x9519;&#x8BEF;&#x201D;&#x7528;&#x4E8E;&#x5F62;&#x5BB9;&#x7A0B;&#x5E8F;&#x683C;&#x5F0F;&#x9519;&#x8BEF;&#x3002;&#x8BED;&#x6CD5;&#x51B2;&#x7A81;&#x4F1A;&#x5728;&#x7A0B;&#x5E8F;&#x6267;&#x884C;&#x4E4B;&#x524D;&#x88AB;&#x68C0;&#x6D4B;&#x5230;&#x3002;&#x4E00;&#x4F46;&#x51FA;&#x73B0;&#xFF0C; &#x4F1A;&#x5F15;&#x53D1;<code>&amp;syntax</code>&#x7C7B;&#x578B;&#x7684;&#x5F02;&#x5E38;&#xFF0C;&#x5E76;&#x4E14;&#x7A0B;&#x5E8F;&#x4E0D;&#x6267;&#x884C;&#x3002;</p>
<p>&#x672C;&#x4E66;&#x4E2D;&#x4F7F;&#x7528;&#x7684;&#x6392;&#x7248;&#x89C4;&#x5B9A;&#x975E;&#x5E38;&#x7B80;&#x5355;&#x3002;&#x6240;&#x6709;Scheme&#x5BF9;&#x8C61;&#x5747;&#x4EE5;<code>&#x6253;&#x5370;&#x5B57;&#x4F53;</code>&#x8F93;&#x51FA;&#xFF0C;&#x5C31;&#x50CF;&#x8981;&#x5728;&#x952E;&#x76D8;&#x4E0A;&#x8F93;&#x5165;&#x4E00;&#x6837;&#x3002;Scheme&#x5BF9;&#x8C61;&#x5305;&#x62EC;&#x8BED;&#x6CD5;&#x5173;&#x952E;&#x5B57;&#xFF0C;&#x53D8;&#x91CF;&#xFF0C;&#x5E38;&#x91CF;&#x5BF9;&#x8C61;&#xFF0C;Scheme&#x8868;&#x8FBE;&#x5F0F;&#x548C;&#x793A;&#x4F8B;&#x7A0B;&#x5E8F;&#x3002;<em>&#x659C;&#x4F53;</em>&#x7528;&#x4E8E;&#x5728;&#x8BED;&#x6CD5;&#x5F62;&#x5F0F;&#x7684;&#x63CF;&#x8FF0;&#x4E2D;&#x7A81;&#x51FA;&#x8BED;&#x6CD5;&#x53D8;&#x91CF;&#xFF0C;&#x5728;&#x8FC7;&#x7A0B;&#x7684;&#x63CF;&#x8FF0;&#x4E2D;&#x7A81;&#x51FA;&#x53C2;&#x6570;&#x3002;&#x659C;&#x4F53;&#x8FD8;&#x53EF;&#x4EE5;&#x7A81;&#x51FA;&#x9996;&#x6B21;&#x51FA;&#x73B0;&#x7684;&#x4E13;&#x4E1A;&#x8BCD;&#x6C47;&#x3002;&#x4E00;&#x822C;&#x800C;&#x8A00;&#xFF0C;&#x5373;&#x4F7F;&#x5728;&#x53E5;&#x5B50;&#x5F00;&#x5934;&#xFF0C;&#x8BED;&#x6CD5;&#x5F62;&#x5F0F;&#x548C;&#x8FC7;&#x7A0B;&#x7684;&#x540D;&#x79F0;&#x4E5F;&#x4E0D;&#x4F1A;&#x5927;&#x5199;&#xFF0C;&#x7528;&#x659C;&#x4F53;&#x5199;&#x7684;&#x8BED;&#x6CD5;&#x53D8;&#x91CF;&#x4E5F;&#x4E00;&#x6837;&#x3002;</p>
<p>&#x5728;&#x8BED;&#x6CD5;&#x5F62;&#x5F0F;&#x6216;&#x8FC7;&#x7A0B;&#x7684;&#x63CF;&#x8FF0;&#x4E2D;&#xFF0C;&#x539F;&#x578B;&#x6A21;&#x5F0F;&#x4F1A;&#x663E;&#x793A;&#x8BED;&#x6CD5;&#x5F62;&#x5F0F;&#x6216;&#x6B63;&#x786E;&#x7684;&#x53C2;&#x6570;&#x4E2A;&#x6570;&#x3002;&#x5173;&#x952E;&#x5B57;&#x6216;&#x8FC7;&#x7A0B;&#x540D;&#x79F0;&#xFF0C;&#x5305;&#x62EC;&#x62EC;&#x53F7;&#xFF0C;&#x90FD;&#x4EE5;&#x6253;&#x5370;&#x5B57;&#x4F53;&#x7ED9;&#x51FA;&#x3002;&#x5269;&#x4E0B;&#x7684;&#x8BED;&#x6CD5;&#x6216;&#x81EA;&#x53D8;&#x91CF;&#x4EE5;&#x659C;&#x4F53;&#x663E;&#x793A;&#xFF0C;&#x7528;&#x7684;&#x540D;&#x79F0;&#x5305;&#x542B;&#x8BED;&#x6CD5;&#x5F62;&#x5F0F;&#x6216;&#x8FC7;&#x7A0B;&#x6240;&#x671F;&#x671B;&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#x6216;&#x81EA;&#x53D8;&#x91CF;&#x7684;&#x7C7B;&#x578B;&#x3002;&#x7701;&#x7565;&#x53F7;&#x7528;&#x4E8E;&#x8868;&#x793A;&#x5B50;&#x8868;&#x8FBE;&#x5F0F;&#x6216;&#x53C2;&#x6570;&#x96F6;&#x6B21;&#x6216;&#x591A;&#x6B21;&#x51FA;&#x73B0;&#x3002;&#x4F8B;&#x5982;&#xFF0C;<code>(or expr ...)</code>&#x63CF;&#x8FF0;&#x4E86;&#x5177;&#x6709;&#x96F6;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x5B50;&#x8868;&#x8FBE;&#x5F0F;&#x7684;<code>or</code>&#x8BED;&#x6CD5;&#x5F62;&#x5F0F;&#xFF0C;&#x800C; <code>(member obj list)</code>&#x63CF;&#x8FF0;&#x4E86;<code>member</code>&#x8FC7;&#x7A0B;&#xFF0C;&#x5B83;&#x9700;&#x8981;&#x4E24;&#x4E2A;&#x53C2;&#x6570;&#x2014;&#x2014;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x548C;&#x4E00;&#x4E2A;&#x5217;&#x8868;&#x3002;</p>
<p>&#x5982;&#x679C;&#x8BED;&#x6CD5;&#x5F62;&#x5F0F;&#x7684;&#x7ED3;&#x6784;&#x4E0E;&#x5176;&#x539F;&#x578B;&#x4E0D;&#x5339;&#x914D;&#xFF0C;&#x5219;&#x4F1A;&#x53D1;&#x751F;&#x8BED;&#x6CD5;&#x9519;&#x8BEF;&#x3002;&#x540C;&#x6837;&#xFF0C;&#x5982;&#x679C;&#x4F20;&#x9012;&#x7ED9;&#x6807;&#x51C6;&#x8FC7;&#x7A0B;&#x7684;&#x53C2;&#x6570;&#x6570;&#x91CF;&#x4E0E;&#x6307;&#x5B9A;&#x8981;&#x63A5;&#x6536;&#x7684;&#x6570;&#x91CF;&#x4E0D;&#x5339;&#x914D;&#xFF0C;&#x5219;&#x4F1A;&#x5F15;&#x53D1;&#x6761;&#x4EF6;&#x7C7B;&#x578B;&#x4E3A;<code>&amp;assertion</code>&#x7684;&#x5F02;&#x5E38;&#x3002;&#x5982;&#x679C;&#x6807;&#x51C6;&#x8FC7;&#x7A0B;&#x63A5;&#x63A5;&#x6536;&#x5230;&#x7684;&#x53C2;&#x6570;&#x7C7B;&#x578B;&#x4E0D;&#x7B26;&#x5408;&#x8981;&#x6C42;&#xFF0C;&#x4E5F;&#x4F1A;&#x5F15;&#x53D1;<code>&amp;assertion</code>&#x5F02;&#x5E38;&#x3002;&#x4F8B;&#x5982;&#xFF0C;<code>vector-set!</code>&#x7684;&#x539F;&#x578B;&#x662F;&#xFF1A;</p>
<p><code>(vector-set! vecotr n obj)</code></p>
<p>&#x63CF;&#x8FF0;&#x8BF4;&#xFF0C;n&#x5FC5;&#x987B;&#x662F;&#x4E00;&#x4E2A;&#x5C0F;&#x4E8E;<code>vector</code>&#x957F;&#x5EA6;&#x7684;&#x7CBE;&#x786E;&#x975E;&#x8D1F;&#x6574;&#x6570;&#x3002;&#x8FD9;&#x6837;&#xFF0C;<code>vector-set!</code>&#x5FC5;&#x987B;&#x63A5;&#x6536;&#x4E09;&#x4E2A;&#x53C2;&#x6570;&#xFF0C;&#x7B2C;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#x5FC5;&#x987B;&#x662F;&#x5411;&#x91CF;&#xFF0C;&#x7B2C;&#x4E8C;&#x4E2A;&#x53C2;&#x6570;&#x5FC5;&#x987B;&#x662F;&#x5C0F;&#x4E8E;&#x5411;&#x91CF;&#x957F;&#x5EA6;&#x7684;&#x7CBE;&#x786E;&#x975E;&#x8D1F;&#x6574;&#x6570;&#xFF0C;&#x7B2C;&#x4E09;&#x4E2A;&#x53C2;&#x6570;&#x53EF;&#x4EE5;&#x662F;&#x4EFB;&#x4F55;Scheme&#x503C;&#x3002;&#x5426;&#x5219;&#xFF0C;&#x5C06;&#x5F15;&#x53D1;&#x6761;&#x4EF6;&#x7C7B;&#x578B;&#x4E3A;<code>&amp;assertion</code>&#x7684;&#x5F02;&#x5E38;&#x3002;</p>
<p>&#x5728;&#x5927;&#x591A;&#x6570;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6240;&#x9700;&#x7684;&#x53C2;&#x6570;&#x7C7B;&#x578B;&#x5F88;&#x660E;&#x663E;&#xFF0C;&#x4F8B;&#x5982;<code>vector</code>&#xFF0C;<code>obj</code>&#x6216;<code>binary-input-port</code>&#x3002;&#x5176;&#x4ED6;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4E3B;&#x8981;&#x5728;&#x6570;&#x5B57;&#x4F8B;&#x7A0B;&#x7684;&#x63CF;&#x8FF0;&#x4E2D;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x7F29;&#x5199;&#xFF0C;&#x4F8B;&#x5982;<code>int</code>&#x8868;&#x793A;&#x6574;&#x6570;&#xFF0C;<code>exint</code>&#x8868;&#x793A;&#x7CBE;&#x786E;&#x6574;&#x6570;&#xFF0C;<code>fx</code>&#x8868;&#x793A;&#x56FA;&#x5B9A;&#x6574;&#x6570;&#x3002;&#x5728;&#x5305;&#x542B;&#x53D7;&#x5F71;&#x54CD;&#x6761;&#x76EE;&#x7684;&#x5404;&#x8282;&#x5F00;&#x5934;&#xFF0C;&#x5BF9;&#x8FD9;&#x4E9B;&#x7F29;&#x5199;&#x8FDB;&#x884C;&#x4E86;&#x8BF4;&#x660E;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="00.Terminology.html" class="navigation navigation-prev " aria-label="Previous page: 00. 术语表">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="02.GettingStarted.html" class="navigation navigation-next " aria-label="Next page: 02. 开始">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"01. 介绍","level":"1.3","depth":1,"next":{"title":"02. 开始","level":"1.4","depth":1,"path":"02.GettingStarted.md","ref":"02.GettingStarted.md","articles":[]},"previous":{"title":"00. 术语表","level":"1.2","depth":1,"path":"00.Terminology.md","ref":"00.Terminology.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"01.Introduction.md","mtime":"2020-07-10T19:40:01.636Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-07-10T19:40:29.654Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

